## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: digitalocean
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place

Terraform will perform the following actions:

  # kubernetes_namespace.cinema will be created
+   resource "kubernetes_namespace" "cinema" {
+       id = (known after apply)

+       metadata {
+           generation       = (known after apply)
+           labels           = {
+               "istio-injection" = "enabled"
            }
+           name             = "cinema"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # kubernetes_secret.argocd-tls will be created
+   resource "kubernetes_secret" "argocd-tls" {
+       data = (sensitive value)
+       id   = (known after apply)
+       type = "Opaque"

+       metadata {
+           generation       = (known after apply)
+           name             = "wayofthesys-org-argocd-tls"
+           namespace        = "kube-argocd"
+           resource_version = (known after apply)
+           uid              = (known after apply)
        }
    }

  # tls_cert_request.request will be created
+   resource "tls_cert_request" "request" {
+       cert_request_pem = (known after apply)
+       id               = (known after apply)
+       key_algorithm    = (known after apply)
+       private_key_pem  = (sensitive value)

+       subject {
+           common_name  = "wayofthesys.org"
+           organization = "WayOfTheSys"
        }
    }

  # tls_locally_signed_cert.cert will be created
+   resource "tls_locally_signed_cert" "cert" {
+       allowed_uses          = [
+           "cert_signing",
+           "client_auth",
+           "digital_signature",
+           "key_encipherment",
+           "server_auth",
        ]
+       ca_cert_pem           = (known after apply)
+       ca_key_algorithm      = (known after apply)
+       ca_private_key_pem    = (sensitive value)
+       cert_pem              = (known after apply)
+       cert_request_pem      = (known after apply)
+       early_renewal_hours   = 0
+       id                    = (known after apply)
+       is_ca_certificate     = false
+       ready_for_renewal     = false
+       set_subject_key_id    = false
+       validity_end_time     = (known after apply)
+       validity_period_hours = 8760
+       validity_start_time   = (known after apply)
    }

  # tls_private_key.ca will be created
+   resource "tls_private_key" "ca" {
+       algorithm                     = "RSA"
+       ecdsa_curve                   = "P224"
+       id                            = (known after apply)
+       private_key_openssh           = (sensitive value)
+       private_key_pem               = (sensitive value)
+       private_key_pem_pkcs8         = (sensitive value)
+       public_key_fingerprint_md5    = (known after apply)
+       public_key_fingerprint_sha256 = (known after apply)
+       public_key_openssh            = (known after apply)
+       public_key_pem                = (known after apply)
+       rsa_bits                      = 2048
    }

  # tls_private_key.key will be created
+   resource "tls_private_key" "key" {
+       algorithm                     = "RSA"
+       ecdsa_curve                   = "P224"
+       id                            = (known after apply)
+       private_key_openssh           = (sensitive value)
+       private_key_pem               = (sensitive value)
+       private_key_pem_pkcs8         = (sensitive value)
+       public_key_fingerprint_md5    = (known after apply)
+       public_key_fingerprint_sha256 = (known after apply)
+       public_key_openssh            = (known after apply)
+       public_key_pem                = (known after apply)
+       rsa_bits                      = 2048
    }

  # tls_self_signed_cert.ca will be created
+   resource "tls_self_signed_cert" "ca" {
+       allowed_uses          = [
+           "cert_signing",
+           "digital_signature",
+           "key_encipherment",
        ]
+       cert_pem              = (known after apply)
+       early_renewal_hours   = 0
+       id                    = (known after apply)
+       is_ca_certificate     = true
+       key_algorithm         = (known after apply)
+       private_key_pem       = (sensitive value)
+       ready_for_renewal     = false
+       set_authority_key_id  = false
+       set_subject_key_id    = false
+       validity_end_time     = (known after apply)
+       validity_period_hours = 8760
+       validity_start_time   = (known after apply)

+       subject {
+           common_name  = "ca.local"
+           organization = "WayOfTheSys"
        }
    }

  # module.argocd.module.argocd_redis.module.argocd_redis[0].kubernetes_service_account.redis_service_account will be updated in-place
!   resource "kubernetes_service_account" "redis_service_account" {
        id                              = "kube-argocd/argocd-redis"
        # (1 unchanged attribute hidden)

-       secret {
-           name = "argocd-redis-token-mhvpj" -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 7 to add, 1 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:digitalocean workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| digitalocean | default | 0.00 | 0.00 | 0.00|
| | **Total** | **0.00** | **0.00** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
